-- MySQL dump 10.13  Distrib 8.0.12, for Win64 (x86_64)
--
-- Host: localhost    Database: test_data
-- ------------------------------------------------------
-- Server version	8.0.12

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8mb4 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `cities`
--

DROP TABLE IF EXISTS `cities`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `cities` (
  `value` varchar(100) NOT NULL,
  PRIMARY KEY (`value`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cities`
--

LOCK TABLES `cities` WRITE;
/*!40000 ALTER TABLE `cities` DISABLE KEYS */;
INSERT INTO `cities` VALUES ('Амстердам'),('Антверпен'),('Афины'),('Барселона'),('Берлин'),('Брюгге'),('Варшава'),('Вашингтон'),('Вена'),('Венеция'),('Гагра'),('Гамбург'),('Дрезден'),('Дубай'),('Дубровник'),('Евпатория'),('Ейск'),('Екатеринбург'),('Женева'),('Загреб'),('Иерусалим'),('Ижевск'),('Иркутск'),('Йошкар-Ола'),('Казань'),('Кёльн'),('Киев'),('Лас-Вегас'),('Лондон'),('Лос-Анджелес'),('Мадрид'),('Милан'),('Минск'),('Москва'),('Мюнхен'),('Неаполь'),('Нижний Новгород'),('Новосибирск'),('Нью-Йорк'),('Одесса'),('Омск'),('Осло'),('Париж'),('Пекин'),('Прага'),('Рим'),('Рио-де-Жанейро'),('Ростов-на-Дону'),('Санкт-Петербург'),('Севастополь'),('София'),('Сочи'),('Таллин'),('Тбилиси'),('Тель-Авив'),('Ульяновск'),('Уфа'),('Филадельфия'),('Флоренция'),('Хайфа'),('Ханой'),('Харьков'),('Хельсинки'),('Хошимин'),('Цюрих'),('Чебоксары'),('Челябинск'),('Чикаго'),('Шанхай'),('Штутгарт'),('Щецин'),('Эйлат'),('Эйндховен'),('Юрмала'),('Якутск'),('Ялта'),('Ярославль');
/*!40000 ALTER TABLE `cities` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `countries`
--

DROP TABLE IF EXISTS `countries`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `countries` (
  `value` varchar(100) NOT NULL,
  PRIMARY KEY (`value`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `countries`
--

LOCK TABLES `countries` WRITE;
/*!40000 ALTER TABLE `countries` DISABLE KEYS */;
INSERT INTO `countries` VALUES ('Австралия'),('Австрия'),('Азербайджан'),('Албания'),('Алжир'),('Ангилья'),('Ангола'),('Андорра'),('Аргентина'),('Армения'),('Аруба'),('Афганистан'),('Багамы'),('Бангладеш'),('Барбадос'),('Бахрейн'),('Беларусь'),('Белиз'),('Бельгия'),('Бенин'),('Бермуды'),('Болгария'),('Боливия'),('Ботсвана'),('Бразилия'),('Бруней'),('Буркина-Фасо'),('Бурунди'),('Бутан'),('Вануату'),('Ватикан'),('Великобритания'),('Венгрия'),('Венесуэла'),('Вьетнам'),('Габон'),('Гаити'),('Гайана'),('Гамбия'),('Гана'),('Гваделупа'),('Гватемала'),('Гвиана'),('Гвинея'),('Германия'),('Гернси'),('Гибралтар'),('Гондурас'),('Гонконг'),('Гренада'),('Гренландия'),('Греция'),('Грузия'),('Гуам'),('Дания'),('Джерси'),('Джибути'),('Египет'),('Замбия'),('Зимбабве'),('Израиль'),('Индия'),('Индонезия'),('Иордания'),('Казахстан'),('Киргизия'),('Латвия'),('Литва'),('Молдавия'),('Приднестровье'),('Россия'),('Таджикистан'),('Туркменистан'),('Узбекистан'),('Украина'),('Эстония');
/*!40000 ALTER TABLE `countries` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `names_female`
--

DROP TABLE IF EXISTS `names_female`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `names_female` (
  `value` varchar(100) NOT NULL,
  PRIMARY KEY (`value`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `names_female`
--

LOCK TABLES `names_female` WRITE;
/*!40000 ALTER TABLE `names_female` DISABLE KEYS */;
INSERT INTO `names_female` VALUES ('Аврора'),('Агата'),('Агнесса'),('Александра'),('Алена'),('Алина'),('Алиса'),('Алла'),('Анастасия'),('Ангелина'),('Анжела'),('Анна'),('Антонина'),('Анфиса'),('Астра'),('Белла'),('Берта'),('Богдана'),('Борислава'),('Бронислава'),('Валентина'),('Валерия'),('Ванда'),('Варвара'),('Венера'),('Вера'),('Вероника'),('Виктория'),('Виолетта'),('Виталина'),('Галина'),('Генриетта'),('Гертруда'),('Глафира'),('Глория'),('Дана'),('Дарина'),('Дарья'),('Джульетта'),('Диана'),('Ева'),('Евгения'),('Екатерина'),('Елена'),('Елизавета'),('Жанна'),('Жозефина'),('Зарина'),('Зинаида'),('Злата'),('Зоя'),('Иванна'),('Изабелла'),('Изольда'),('Илона'),('Инга'),('Инесса'),('Инна'),('Ирина'),('Ирма'),('Карина'),('Каролина'),('Кира'),('Клавдия'),('Клара'),('Кристина'),('Ксения, Оксана'),('Лада'),('Лайма'),('Лариса'),('Леся'),('Лиана'),('Лидия'),('Лиза'),('Лилия'),('Любовь'),('Людмила'),('Майя'),('Маргарита'),('Марина'),('Мария'),('Марта'),('Милена'),('Надежда'),('Нана'),('Наталья'),('Нелли'),('Ника'),('Нила'),('Нина'),('Нора'),('Оксана'),('Олеся'),('Ольга'),('Пелагея'),('Полина'),('Прасковья'),('Рада'),('Раиса'),('Регина'),('Рената'),('Римма'),('Роза'),('Роксана'),('Руслана'),('Сабина'),('Саломея'),('Сара'),('Светлана'),('Серафима'),('Снежана'),('София'),('Станислава'),('Стелла'),('Сусанна'),('Таисия'),('Тамара'),('Татьяна'),('Тереза'),('Ульяна'),('Фаина'),('Фекла'),('Фрида'),('Христина'),('Эвелин'),('Элеонора'),('Элла'),('Эльвира'),('Эльза'),('Эльмира'),('Эмилия'),('Эрика'),('Юлианна'),('Юлия'),('Юнона'),('Ядвига'),('Яна'),('Ярослава');
/*!40000 ALTER TABLE `names_female` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `names_male`
--

DROP TABLE IF EXISTS `names_male`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `names_male` (
  `value` varchar(100) NOT NULL,
  PRIMARY KEY (`value`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `names_male`
--

LOCK TABLES `names_male` WRITE;
/*!40000 ALTER TABLE `names_male` DISABLE KEYS */;
INSERT INTO `names_male` VALUES ('Адам'),('Адольф'),('Александр'),('Алексей'),('Альберт'),('Альфред'),('Анатолий'),('Андрей'),('Антон'),('Аркадий'),('Арсен'),('Арсений'),('Артем'),('Артемий'),('Артур'),('Архип'),('Бенедикт'),('Богдан'),('Болеслав'),('Бонифаций'),('Борис'),('Бронислав'),('Вадим'),('Валентин'),('Валерий'),('Вальтер'),('Василий'),('Вениамин'),('Виктор'),('Вильгельм'),('Виталий'),('Владимир'),('Владислав'),('Влас'),('Вольдемар'),('Всеволод'),('Вячеслав'),('Гавриил'),('Гамлет'),('Гарри'),('Геннадий'),('Генрих'),('Георгий'),('Герман'),('Глеб'),('Гордей'),('Григорий'),('Давид'),('Даниил'),('Демьян'),('Денис'),('Дмитрий'),('Донат'),('Евгений'),('Евдоким'),('Евлампий'),('Егор'),('Елисей'),('Ефим'),('Ефрем'),('Ждан'),('Захар'),('Зиновий'),('Иван, Иоан'),('Игнатий'),('Игорь'),('Илья'),('Иннокентий'),('Иосиф'),('Ипполит'),('Карл'),('Кирил'),('Кондрат'),('Константин'),('Кристиан'),('Лаврентий'),('Лев'),('Леонард'),('Леонид'),('Леонтий'),('Людвиг'),('Макар'),('Максим'),('Максимилиан'),('Марат'),('Марк'),('Матвей'),('Мирон'),('Михаил'),('Моисей'),('Назар'),('Наум'),('Нестор'),('Никита'),('Никодим'),('Николай'),('Овидий'),('Олег'),('Олесь'),('Онисим'),('Осип'),('Оскар'),('Остап'),('Павел'),('Пантелеймон'),('Парамон'),('Петр'),('Платон'),('Потап'),('Радик'),('Рафаэль'),('Рафик'),('Ринат'),('Ричард'),('Роберт'),('Роман'),('Ростислав'),('Руслан'),('Рустам'),('Савелий'),('Самуил'),('Святослав'),('Семен'),('Серафим'),('Сергей'),('Спартак'),('Спиридон'),('Станислав'),('Степан'),('Тарас'),('Теодор'),('Терентий'),('Тимофей'),('Тимур'),('Тихон'),('Трофим'),('Устин'),('Фарид'),('Федор'),('Феликс'),('Феофан'),('Филипп'),('Фома'),('Фридрих'),('Харитон'),('Христиан'),('Шамиль'),('Эдвард'),('Эдгар'),('Эдуард'),('Эльдар'),('Эмиль'),('Эрик'),('Эрнест'),('Юджин'),('Юлиан'),('Юлий'),('Юрий'),('Юхим'),('Яков'),('Ян'),('Янус'),('Ярослав');
/*!40000 ALTER TABLE `names_male` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `regions`
--

DROP TABLE IF EXISTS `regions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `regions` (
  `value` varchar(100) NOT NULL,
  PRIMARY KEY (`value`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `regions`
--

LOCK TABLES `regions` WRITE;
/*!40000 ALTER TABLE `regions` DISABLE KEYS */;
INSERT INTO `regions` VALUES ('Алтайский край'),('Амурская область'),('Архангельская область'),('Астраханская область'),('Белгородская область'),('Брянская область'),('Владимирская область'),('Волгоградская область'),('Вологодская область'),('Воронежская область'),('Еврейская автономная область'),('Забайкальский край'),('Ивановская область'),('Иркутская область'),('Кабардино-Балкарская Республика'),('Калининградская область'),('Калужская область'),('Камчатский край'),('Карачаево-Черкесская Республика'),('Кемеровская область'),('Кировская область'),('Костромская область'),('Краснодарский край'),('Красноярский край'),('Курганская область'),('Курская область'),('Ленинградская область'),('Липецкая область'),('Магаданская область'),('Московская область'),('Мурманская область'),('Ненецкий автономный округ'),('Нижегородская область'),('Новгородская область'),('Новосибирская область'),('Омская область'),('Оренбургская область'),('Орловская область'),('Пензенская область'),('Пермский край'),('Приморский край'),('Псковская область'),('Республика Адыгея'),('Республика Алтай'),('Республика Башкортостан'),('Республика Бурятия'),('Республика Дагестан'),('Республика Ингушетия'),('Республика Калмыкия'),('Республика Карелия'),('Республика Коми'),('Республика Крым'),('Республика Марий Эл'),('Республика Мордовия'),('Республика Саха'),('Республика Северная Осетия - Алания'),('Республика Татарстан'),('Республика Тыва'),('Республика Хакасия'),('Ростовская область'),('Рязанская область'),('Самарская область'),('Саратовская область'),('Сахалинская область'),('Свердловская область'),('Смоленская область'),('Ставропольский край'),('Тамбовская область');
/*!40000 ALTER TABLE `regions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `second_names_root`
--

DROP TABLE IF EXISTS `second_names_root`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `second_names_root` (
  `value` varchar(100) NOT NULL,
  PRIMARY KEY (`value`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `second_names_root`
--

LOCK TABLES `second_names_root` WRITE;
/*!40000 ALTER TABLE `second_names_root` DISABLE KEYS */;
INSERT INTO `second_names_root` VALUES ('Александров'),('Алексеев'),('Альбертов'),('Анатольев'),('Андреев'),('Антонов'),('Аркадьев'),('Артемов'),('Архипов'),('Аскольдов'),('Афанасьев'),('Богданов'),('Болеславов'),('Борисов'),('Вадимов'),('Валентинов'),('Валериев'),('Васильев'),('Вениаминов'),('Викторов'),('Владимиров'),('Владиславов'),('Вячеславов'),('Геннадиев'),('Геннадьев'),('Георгиев'),('Григорьев'),('Данилов'),('Дмитриев'),('Евгеньев'),('Егоров'),('Ефимов'),('Жданов'),('Захаров'),('Иванов'),('Игорев'),('Ильинич'),('Кириллов'),('Константинов'),('Леонидов'),('Леонов'),('Львов'),('Макаров'),('Максимов'),('Матвеев'),('Миронов'),('Михайлов'),('Натанов'),('Наумов'),('Никифоров'),('Николаев'),('Нилов'),('Олегов'),('Оскаров'),('Павлов'),('Петров'),('Романов'),('Рубенов'),('Рудольфов'),('Русланов'),('Семенов'),('Сергеев'),('Станиславов'),('Степанов'),('Тарасов'),('Тимофеев'),('Тимуров'),('Федоров'),('Феликсов'),('Филиппов'),('Харитонов'),('Эдуардов'),('Эльдаров'),('Юльев'),('Юрьев'),('Яковлев');
/*!40000 ALTER TABLE `second_names_root` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `streets`
--

DROP TABLE IF EXISTS `streets`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `streets` (
  `value` varchar(100) NOT NULL,
  PRIMARY KEY (`value`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `streets`
--

LOCK TABLES `streets` WRITE;
/*!40000 ALTER TABLE `streets` DISABLE KEYS */;
INSERT INTO `streets` VALUES ('Верхняя Первомайская улица'),('Главная аллея'),('Елагинский проспект'),('Заводской проезд'),('Измайловская Пасека, посёлок'),('Измайловская площадь'),('Измайловский бульвар'),('Измайловский проезд'),('Измайловский проспект'),('Измайловского Зверинца 1-й, переулок'),('Измайловского Зверинца 1-я, улица'),('Измайловского Зверинца 2-й, переулок'),('Измайловского Зверинца 2-я, улица'),('Измайловское шоссе'),('Имени Баумана, городок'),('Круга Большого, аллея'),('Московский проспект'),('Народный проспект'),('Нижняя Первомайская улица'),('Никитинская улица'),('Парковая 1-я, улица'),('Парковая 10-я, улица'),('Парковая 11-я, улица'),('Парковая 2-я, улица'),('Парковая 3-я, улица'),('Парковая 4-я, улица'),('Парковая 5-я, улица'),('Парковая 6-я, улица'),('Парковая 7-я, улица'),('Парковая 8-я, улица'),('Парковая 9-я, улица'),('Первомайская аллея'),('Первомайская улица'),('Проектируемый проезд N 890'),('Пролетарского Входа, аллея'),('Прядильная 1-я, улица'),('Прядильная 2-я, улица'),('Прядильная 3-я, улица'),('Сиреневый бульвар'),('Советская улица'),('Соколиной Горы 8-я, улица'),('Средняя Первомайская улица'),('Щёлковское шоссе'),('Энтузиастов шоссе');
/*!40000 ALTER TABLE `streets` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `surnames_root`
--

DROP TABLE IF EXISTS `surnames_root`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `surnames_root` (
  `value` varchar(100) NOT NULL,
  PRIMARY KEY (`value`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `surnames_root`
--

LOCK TABLES `surnames_root` WRITE;
/*!40000 ALTER TABLE `surnames_root` DISABLE KEYS */;
INSERT INTO `surnames_root` VALUES ('Абрамов'),('Акимов'),('Александров'),('Алексеев'),('Андреев'),('Анисимов'),('Антонов'),('Архипов'),('Афанасьев'),('Баранов'),('Белов'),('Белоусов'),('Беляев'),('Бирюков'),('Богданов'),('Борисов'),('Быков'),('Васильев'),('Виноградов'),('Власов'),('Волков'),('Воробьев'),('Воронин'),('Гаврилов'),('Галкин'),('Герасимов'),('Голубев'),('Гончаров'),('Горбунов'),('Грачев'),('Григорьев'),('Гришин'),('Громов'),('Гусев'),('Давыдов'),('Данилов'),('Денисов'),('Дмитриев'),('Егоров'),('Емельянов'),('Еремин'),('Ермаков'),('Ефимов'),('Ефремов'),('Жуков'),('Журавлев'),('Зайцев'),('Захаров'),('Иванов'),('Ильин'),('Исаев'),('Казаков'),('Калинин'),('Карпов'),('Кириллов'),('Киселев'),('Климов'),('Князев'),('Ковалев'),('Козлов'),('Колесников'),('Комаров'),('Кондратьев'),('Коновалов'),('Королев'),('Котов'),('Крылов'),('Кудрявцев'),('Кузнецов'),('Кузьмин'),('Куликов'),('Лазарев'),('Лебедев'),('Левин'),('Леонов'),('Лукьянов'),('Макаров'),('Максимов'),('Малышев'),('Марков'),('Мартынов'),('Маслов'),('Матвеев'),('Медведев'),('Мельников'),('Миронов'),('Михайлов'),('Михеев'),('Моисеев'),('Морозов'),('Назаров'),('Наумов'),('Нестеров'),('Никитин'),('Никифоров'),('Николаев'),('Новиков'),('Овчинников'),('Орлов'),('Осипов'),('Павлов'),('Панов'),('Петров'),('Поляков'),('Пономарев'),('Попов'),('Потапов'),('Прокофьев'),('Прохоров'),('Родионов'),('Романов'),('Румянцев'),('Савельев'),('Семенов'),('Сергеев'),('Сидоров'),('Симонов'),('Скворцов'),('Смирнов'),('Соболев'),('Соколов'),('Соловьев'),('Сорокин'),('Степанов'),('Тарасов'),('Тимофеев'),('Титов'),('Тихомиров'),('Тихонов'),('Трофимов'),('Федоров'),('Федотов'),('Филатов'),('Филиппов'),('Фомин'),('Фролов'),('Харитонов'),('Цветков'),('Чернов'),('Чернышев'),('Щербаков'),('Юдин'),('Яковлев');
/*!40000 ALTER TABLE `surnames_root` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gender` varchar(1) DEFAULT NULL,
  `last_name` varchar(45) DEFAULT NULL,
  `first_name` varchar(45) DEFAULT NULL,
  `patronymic` varchar(45) DEFAULT NULL,
  `age` int(11) DEFAULT NULL,
  `birthday` date DEFAULT NULL,
  `postal_code` varchar(6) DEFAULT NULL,
  `country` varchar(45) DEFAULT NULL,
  `region` varchar(45) DEFAULT NULL,
  `city` varchar(45) DEFAULT NULL,
  `street` varchar(45) DEFAULT NULL,
  `house` int(11) DEFAULT NULL,
  `appartment` int(11) DEFAULT NULL,
  `inn` varchar(12) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-10-21 22:44:35
